[
{"name": "Monkey D. Luffy", "summary": "Monkey D. Luffy is the protagonist in One Piece and captain of the increasingly infamous and powerful Straw Hat Pirates. He ate the Gum-Gum Devil Fruit that changed his body to rubber. His dream is to find the legendary One Piece and become Pirate King. He has made quite a name for himself around the world and has a bounty on his head to match - 1,500,000,000 Berries. Despite his naive attitude, he is an amazing leader who the Straw Hats follow with pride."},
{"name": "Roronoa Zoro", "summary": "Roronoa Zoro is the swordsman, first member and Vice Captain of the Straw Hat Pirates. He uses the Santoryu-style (Three Sword Style) of sword combat and aims to become the world's greatest swordsman. He has a bounty of 320,000,000 berries and is one of the eleven supernova rookies of the 'Worst Generation' of pirates."},
{"name": "Nami", "summary": "Nami is the navigator of the Straw Hat Pirates and a skilled cartographer. She's a lover of money and mikans who dreams of making a map of the world. She currently has a bounty of 66,000,000 beri."},
{"name": "Usopp", "summary": "Usopp is the sniper of the Straw Hat Pirates who is famous for frequently lying. He wants to be a great warrior of the sea."},
{"name": "Vinsmoke Sanji", "summary": "Sanji Vinsmoke is the cook of the Straw Hat Pirates and lover of all things women. His dream is to find the All Blue of the sea. His bounty is currently 330,000,000 beri."},
{"name": "Nico Robin", "summary": "Nico Robin is the archaeologist of the Straw Hat Pirates, who has the powers of the Bloom-Bloom Devil Fruit. Once an officer of the evil Baroque Works Organization, Robin left them and joined the Straw Hats. She currently has a bounty 130,000,000 beri."},
{"name": "Tony Tony Chopper", "summary": "Tony Tony Chopper is the doctor of the Straw Hat Pirates. He was a normal reindeer until he ate the Human-Human Fruit, which allows him to talk and transform."},
{"name": "Franky", "summary": "Franky is the shipwright of the Straw Hat Pirates and a self-made cyborg. He built the Thousand Sunny. He is a former disciple of Tom, a fishman shipwright who built the Oro Jackson (Gol D. Roger's ship) using the wood of the Treasure Tree Adam. His real name is Cutty Flam."},
{"name": "Brook", "summary": "\"Soul King\" Brook is a member of the Straw Hat Pirates, serving as their musician. He is a Devil Fruit user who ate the Yomi Yomo no Mi (Revive-Revive Fruit), and is undead, having died and return to life in a pseudo-immortal state because of the fruit."},
{"name": "Nefertari Vivi", "summary": "Princess of Alabasta, she teamed up with straw hat crew to defeat Baroque works and save Alabasta. Her codename in baroque works is Miss wednesday."},
{"name": "Buggy the Clown", "summary": "Buggy is a \"flashy\" pirate captain who dresses himself as a clown. Buggy has consumed a Devil Fruit called Bara Bara no Mi, and this gave him the power to split his body into pieces. But, it also took away his ability to swim. He was an apprentice on Gol D. Roger's ship."},
{"name": "Trafalgar D. Water Law", "summary": "Trafalgar Law is the captain of the Heart Pirates and one of the Eleven Supernovas. He ate the OP-Op Devil Fruit and can modify anything within his created area of effect. He is a rival and temporary ally for Luffy with a bounty of 500,000,000 Berries."},
{"name": "Crocodile", "summary": "A former hero of Arabasta, Crocodile can control and turn into sand, as well as absorb moisture from any material. He was the mastermind behind Baroque Works. He has the logia type Sand-Sand Fruit (Suna Suna no Mi) and his codename in Baroque Works was Mr. 0, with Nico Robin being his partner in the organization. He was a member of the Shichibukai. The long scar across his face is an injury he received as a result of his fight with Whitebeard."},
{"name": "Smoker", "summary": "Smoker the White Hunter is a Marine Vice Admiral and Commander of the G-5 Marine Base. He has the powers of the Smoke-Smoke Fruit. He is a recurring adversary of Monkey D. Luffy and the Straw Hats. He is the primary antagonist of the Loguetown Arc and the a minor antagonist of the Marineford Arc."},
{"name": "Portgaz D. Ace", "summary": "The only son of Gol D. Roger, Portgas D. Ace (Gol D. Ace) was well renown and very powerful pirate. He was the user of the Flame-Flame Fruit (Mera-Mera no Mi) and was the Second Division Commander of the Whitebeard Pirates. Ace was adopted by Monkey D. Garp. He is the adoptive older brother of Monkey D. Luffy and Sabo."},
{"name": "Jimbei", "summary": "Jimbei is a whale shark fish-man, who was once a member of the Seven Warlords. He is the helmsman of the Straw Hat Pirates. He was the second captain of the Sun Pirates after Fisher Tiger."},
{"name": "Donquixote Doflamingo", "summary": "Donquixote Doflamingo is the captain of the Donquixote Pirates, former Shickbukai, former king of Dressrosa, and former World Noble. He was the underground's most inferential broker under the alias, Joker. He possesses a devil fruit known as the string-string fruit (Ito Ito no Mi). He is a major antagonist of the Marineford Arc, and the main antagonist of the Dressrosa Saga and the Dressrosa Arc."},
{"name": "Tashigi", "summary": "Tashigi is a sword-loving member of the Marine forces and second-only to Smoker. She's determined to defeat Roronoa Zoro and claim his swords. After the timeskip, she is able to use Armament Haki (Busoshoku Haki) to some degree as well as use Soru, one of the Rokushiki techniques. She along with her superior Smoker have been transferred to G5 Marine branch and has been promoted to the rank of captain."},
{"name": "Karoo", "summary": "Karoo is a member of the Super Spot-Billed Duck Squad and childhood pet to Princess Vivi of Alabasta."},
{"name": "Blackbeard", "summary": "Blackbeard is the Admiral of the Blackbeard Pirates and currently is one of the four Yonko. He was once a member of the Whitebeard Pirates and later a shichibukai. He murdered his commander and Whitebeard for the Yami-Yami no mi and Gura-Gura no mi. His real name is Marshall D. Teach."},
{"name": "Jango", "summary": "Jango was a former pirate in the Black Cat Pirates, but joined the Navy to serve under Captain Hina."},
{"name": "Rob Lucci", "summary": "Rob Lucci is the strongest member of the Cipher Pol No. 9. On top of eating the Cat-Cat Fruit Model: Leopard, he is a master of the Six Powers martial arts. After the timeskip, he is once again affiliated with the World Government and is now an official member of Cipher Pol Aigis Zero and is also Spandam's superior."},
{"name": "Hatchan", "summary": "Hatchan was once a member of the fishmen pirate group Sunny Pirates. Hatchan is now currently a good guy and friends with The Straw Hat Pirates."},
{"name": "Monkey D. Garp", "summary": "Monkey D. Garp is a famous and powerful Marine vice admiral. He is the father of Monkey D. Dragon, the paternal grandfather of Monkey D. Luffy, and the adoptive grandfather of Portgas D. Ace. He was also the commanding officer of the 153rd Branch of the Marines and the man in charge of both Koby and Helmeppo. He is close friends with his former superior, Sengoku."},
{"name": "Kuzan", "summary": "Kuzan, better known by his former epithet Aokiji, is a former Marine admiral. He ate the Ice-Ice Fruit, turning the him into a Freezing Man. He was a former friend of vice-admiral Jaguar D. Saul and shares a history with Nico Robin. Currently, he is allied with the Blackbeard Pirates for unknown reasons."},
{"name": "Hattori", "summary": "Hattori is the loyal pet to Rob Lucci of the Cipher Pol 9. During Lucci's time undercover in the Galley-La Company. Hattori played the role of the ventriloquist dummy for Lucci"},
{"name": "Kokoro", "summary": "Kokoro is an icefish mermaid and assistant to Tom. Now she lives with her grand daughter Chimney at the Sea Train Station"},
{"name": "Daz Bones", "summary": "The second most powerful member of Baroque Works, he uses his amazing Devil Fruit abilities to execute targets. His partner is Miss Doublefinger."},
{"name": "Mr. 3", "summary": "Member of Baroque Works, he ate the Doru Doru no Mi. His partner is Miss Goldenweek. He is later imprisoned in Impel Down."},
{"name": "Jesus Burgess", "summary": "The strongman for the Blackbeard pirates"},
{"name": "Nefertari Cobra", "summary": "Nefertari Cobra is the wise king of the Alabasta Kingdom and father to Princess Vivi."},
{"name": "Dracule Mihawk", "summary": "Dracule \"Hawk Eyes\" Mihawk is the world's strongest swordsman and a former member of the Seven Warlords of the Sea. He and Jimbei were the only Warlords not to possess a Devil Fruit. He once had a rivalry with Shanks, one of the Four Emperors of New World. He is the first Warlord to be shown in the series."},
{"name": "Kalifa", "summary": "Kalifa is a member of Cipher Pol No. 9, who posed as the secretary of Iceberg. She possesses the power of the Bubble-Bubble Fruit. She is the only female member of CP9."},
{"name": "Kaku", "summary": "Kaku is a member of CP9, he possesses the power of the Devil Fruit Horse-Horse Fruit Model: Giraffe."},
{"name": "Bon Clay", "summary": "Bon Clay was once Mr. 2 of Baroque Works and now a stead fast ally of Monkey D. Luffy. He ate the Copy-Copy Fruit."},
{"name": "Bartholomew Kuma", "summary": "Kuma used to be a merciless powerful pirate before he allowed the world government experiment on him and turn him into a cyborg. He now is a shichibukai and works for the world government. He ate the paw paw fruit (Nikyu Nikyu no Mi) which allows him to push/repel anything such as air. He has a former bounty of 296,000,000 beri."},
{"name": "Kin'emon", "summary": "Kin'emon is a samurai from the Land of Wano. He is an ally to the Straw Hat-Heart Pirate Alliance. He is the leader and captain of the Nine Red Scabbards and is one of Kozuki Oden's retainers."},
{"name": "Camie", "summary": "Camie is a kissing gourami mermaid from Fish-Man Island. She is good friends with Hatchan, and is easily captured."},
{"name": "Igaram", "summary": "Igaram is the lead adviser to the king of Alabasta. He joined Princess Vivi to infultrate the evil organization, Baroque Works"},
{"name": "Paulie", "summary": "Paulie is a prudish carpenter of the Galley-La Company."},
{"name": "Sengoku", "summary": "Sengoku was the fleet admiral of the Marines until his retirement. He was a former admiral during the Battle of Edd War. He ate the Human Human Fruit, Model: Daibutsu, a Mythical Zoan-type Devil Fruit. He is close friends with Vice Admiral Garp."},
{"name": "Chimney", "summary": "Chimney is the grand daughter of the Sea Train Conductor, Kokoro. A fun and out going child. She's never seen without her rabbit friend Gonbe, that thinks it's a cat."},
{"name": "Fullbody", "summary": "Fullbody was at one time a Navy captain and ladies man. Now demoted to a recruit level as a subordinate under Captain Hina."},
{"name": "Iceberg", "summary": "Iceberg is not only the president of the Galley-La Company, but he is also the beloved mayor of Water Seven. He, along with Franky, with disciples of Tom, a fishman shipwright who built Gol D. Roger's ship."},
{"name": "Pappagu", "summary": "Pappagu is a starfish fish-man and pet/master to the mermaid Camie. He's a famous clothing designer of the Criminal brand of apparel."},
{"name": "Peepley Lulu", "summary": "Peepley Lulu is a shipwright of the Galley-La Company, Dock One. He has very uncontrollable hair."},
{"name": "Gonbe", "summary": "Gonbe is the pet rabbit of Chimney who thinks he's a cat."},
{"name": "Shanks", "summary": "Shanks is the captain of the Red-Haired Pirates and one of the Four Emperors. He's the man who inspired Luffy to be a pirate and the owner of his straw hat. He once apprenticed on Gol D. Roger's ship. He received his three scars on his face from Blackbeard."},
{"name": "Eneru", "summary": "Eneru is the self proclaimed god of Skypiea. He can control, project and become lightning. His Devil Fruit powers make him the physical menifestation of lightning itself."},
{"name": "Koby", "summary": "Once a pirate in Alvida's crew, he became friends with Luffy and joined the Marines."},
{"name": "Hina", "summary": "Captain Hina is a Navy commander who ate the Cage-Cage Devil Fruit. She become a Rear-Admiral after the timeskip."},
{"name": "Chaka", "summary": "Chaka is one of the two head guards of the Alabasta Kingdom as the Jackal Guardian. He ate the Dog-Dog Fruit - Model Jackal."},
{"name": "Kiwi Square", "summary": "Kiwi Square is one of the Square Sisters and member of the Franky Family. Kiwi is identified by wearing red and wavy bangs."},
{"name": "Mozu Square", "summary": "Mozu Square is one of the Square Sisters and member of the Franky Family. Kiwi is identified by wearing yellow and wearing sunglasses."},
{"name": "Tilestone", "summary": "Tilestone in a member of the Galley-La Company, Dock One."},
{"name": "Zambai", "summary": "Zambai is a member of the Franky Family and the founder's, Franky, right hand man."},
{"name": "Spandam", "summary": "Spandam is the chief director of the Cipher Pol No. 9 team under the banner of the World Government. He is the son of Spandine, the CP9 chief director before Spandam."},
{"name": "Eustass Kid", "summary": "Eustass Kid is one of the Eleven Supernovas. He is among the more popular of the Worst Generation and most certainly one of if not the most dangerous among the group. He is the captain of the Kid pirate crew and the only other crew other than the Strawhats to have a right hand man who is a Supernova too."},
{"name": "Blueno", "summary": "Blueno is a member of CP9 who ate the Door-Door Fruit."},
{"name": "Whitebeard", "summary": "Edward Newgate, better known as Whitebeard, is the captain of the Whitebeard Pirates and widely considered to be the strongest man in the world. He is the only man to ever match the Pirate King Gol D. Roger in a fight. He ate the Tremor-Tremor devil fruit that turned him into a \"Quake Man\" and giving him the power to create destructive shockwaves. He was one of the Yonko, the four most powerful pirates in the world, that rule over the New World, the second half of the Grand Line."},
{"name": "Cabaji", "summary": "Cabaji is the sword wielding Acrobatic of the Buggy Pirates. He is also Second Mate."},
{"name": "Mohji", "summary": "Mohji first-mate of the Buggy Pirates and a lion tamer. He is always with his giant lion, Richie."},
{"name": "Pell", "summary": "Pell is one of the commanders of the Alabasta guards and the strongest fighter in Alabasta."},
{"name": "Richie", "summary": "Richie is the pet lion of Mohji, and member of the Buggy Pirates"},
{"name": "Yokozuna", "summary": "Yokozuna is the giant, sumo frog and friend of Tom the Builder. Scarred over years of attempts trying to stop the Sea Train."},
{"name": "Gecko Moria", "summary": "The captain of Thriller Bark, the largest Ship/Island in One Piece, he also has control over shadows and can create zombies. He was once one of the Shichibukai. He ate the Paramecia-type Kage Kage no mi (Shadow-Shadow Fruit)."},
{"name": "Jabra", "summary": "Jabra is a member of the Cipher Pol 9. He ate the Dog-Dog Fruit: Model Wolf."},
{"name": "Miss Doublefinger", "summary": "Member of Baroque works. Her partner is Mr.1"},
{"name": "Miss Golden Week", "summary": "Miss Golden Week is a former member of Baroque Works organization. She uses special paints call Color's Trap to manipulate people and animals into doing whatever she desires them to do. She is partnered up with Mr. 3."},
{"name": "Lady Alvida", "summary": "Lady Alvida is an enemy of Luffy's and joins Buggy's crew after Luffy defeats her."},
{"name": "Boa Hancock", "summary": "Boa Hancock is the captain of the Kuja Pirates, the Empress of Amazon Lily, and former member of the now defunct Seven Warlords of the Sea. She ate the Love-Love Devil Fruit that allows her to turn people into stone. She is deeply love with Monkey D. Luffy."},
{"name": "Helmeppo", "summary": "Helmeppo is the son of Captain Morgan, who joined the Navy with Coby to work under Monkey D. Garp."},
{"name": "Kizaru", "summary": "Borsalino, better known by his epithet Kizaru, is an admiral in the Marines. He has eaten the Glint-Glint Fruit, making him a Light Human. He was the main antagonist of the Sabaody Archipelago arc and one of the major antagonists of the Marineford arc."},
{"name": "Akainu", "summary": "Sakazuki, formerly known by his epithet Akainu, is the current Fleet Admiral of the Marines. He possesses the abilities of the Logia-type Devil Fruit, the Magma-Magma Fruit (Magu-Magu no Mi). He fought fellow admiral Aokiji for the position of Fleet Admiral for 10 days on Punk Hazard. He was one of the vice-admirals that responded to the buster call on Ohara. He was responsible for killing Portgas D. Ace. He also upholds the belief of Absolute Justice."},
{"name": "Eyelashes", "summary": "Eyelashes is a camel that befriended the Straw Hat crew and carried the girls through the difficult Alabasta Deserts."},
{"name": "Sabo", "summary": "Sabo is the Chief of Staff for the Revolutionary Army. He is the adoptive brother of Monkey D. Luffy and Portgas D. Ace."},
{"name": "Fukurou", "summary": "Fukurô is a member of the Cipher Pol. 9, who can't keep his mouth from leaking secret."},
{"name": "Jozu", "summary": "Jozu is a commander of the whitebeard pirates"},
{"name": "Marco", "summary": "Marco is the former first division commander of the Whitebeard Pirates. He ate a Mythical Zoan type Devil Fruit which allows him to transform into a phoenix at will. After his captain's death, Marco assumed leadership of the Whitebeard Pirates until the crew's disbandment following the Payback War. Since said war during the two-year timeskip, Marco works as a doctor at Whitebeard's home village, Sphinx."},
{"name": "Doc Q", "summary": "Doc Q is the doctor of the Blackbeard Pirates, who is always riding his sickly horse, Stronger."},
{"name": "Bellamy", "summary": "Bellamy is the captain of the Bellamy Pirates who ate the Spring-Spring Devil Fruit."},
{"name": "Rebecca", "summary": "Rebecca is a gladiator at Corrida Colosseum and the granddaughter of Dressrosa's previous king."},
{"name": "Riku Doldo III", "summary": "Riku Doldo III is the once king of Dressrosa before Doflamingo's take over, and the grandfather of Rebecca."},
{"name": "Tsuru", "summary": "Vice-Admiral Tsuru is a master strategist of the Navy. She ate the Wash-Wash Fruit."},
{"name": "Kyros", "summary": "Kyros was a young violent who was given a chance by King Riku to be a better man which he took. He eventually married Princess Scarlet and had a daughter, Rebecca, but his life was ruined when Doflamingo took over Dressrosa and he was transformed in a toy soldier. Now he has the chance to properly live his life with his daughter."},
{"name": "Zeff", "summary": "Zeff is the former pirate known as Red Leg. Now the head chef and owner of the Baratie restaurant. He is Sanji's adoptive and foster father."},
{"name": "Miss Valentine", "summary": "Miss Valentine is a Baroque Works member and is partnered with Mr. 5. She ate the Kilo-Kilo Fruit."},
{"name": "Mr. 5", "summary": "Member of Baroque Works, his partner is Miss Valentine. He ate the Bomu Bomu no Mi, which allows him to turn any part of his body into a bomb without harming himself."},
{"name": "Miss Merry Christmas", "summary": "She is member of Baroque works and partner of Mr.4."},
{"name": "Wapol", "summary": "Wapol was once the king of the Drum Kingdom. He ate the Munch-Munch Fruit that allows him to eat anything."},
{"name": "Basil Hawkins", "summary": "Basil Hawkins is somewhat the noble type. He's also a fortuneteller with a calm personality. With a bounty of 249,000,000 Beli , he is considered one of the Eleven Supernova. After the timeskip, his bounty increased to 320,000,000 beli and has an alliance with Eustass Kid and Scratchman Apoo."},
{"name": "Capone Bege", "summary": "He's calm and collected... until someone pisses him off. He's got manners and class but when he gets mad, all that goes out the window. Capone Bege is one of the eleven supernovas from the worst generation. After the timeskip, he is allied with Big Mom, One of the Four Emperors."},
{"name": "Scratchmen Apoo", "summary": "Scratchmen Apoo is captain of the On Air Pirates from the longarm tribe, and one of the Eleven Supernovas. His Devil Fruit power is linked to music."},
{"name": "Gol D. Roger", "summary": "The late Pirate King who was the captain of the Roger Pirates and owner of the most legendary and renowned treasure, One Piece. He was the lover of Portgas D. Rouge, and the father of Portgas D. Ace. He was born and executed in Loguetown in East Blue. He is commonly known to the world as Gold Roger. Roger was famed as the man who did what no one thought possible – he conquered the Grand Line and amassed a vast fortune."},
{"name": "Bepo", "summary": "Bepo is a talking polar bear who is a member of the Heart Pirates."},
{"name": "Emporio Ivankov", "summary": "Emporio Ivankov is the queen of Kamabakka Kingdom and a commander of the Revolutionaries. He ate the Horm-Horm Fruit, that gives him control over hormones."},
{"name": "Caribou", "summary": "A murderous rookie pirate. Having eaten the Numa Numa no Mi, he is able to generate and control swamp muck."},
{"name": "Caesar Clown", "summary": "Caesar Clown is a mad scientist and former colleague of the famous Dr. Vegapunk. He's famous for his creation of weapons of mass murder. He possesses the logia-type Gasu Gasu no Mi (Gas-Gas Fruit). He is the main antagonist of the Punk Hazard arc."},
{"name": "Kozuki Momonosuke", "summary": "Momonosuke is a young samurai boy who's the son of Kinemon. He ate the man-made Devil Fruit that transformed him into a dragon."},
{"name": "Diamante", "summary": "Diamante is a member of the Don Quixote Pirates, and the Hero of the Corrida Colosseum in Dressrosa."},
{"name": "Machvise", "summary": "Machvise is a member of the Don Quixote Pirates."},
{"name": "Viola", "summary": "Viola is the former princess of Dressrosa and daughter to King Riku. She agreed to work for the Don Quixote Family under the name Violet to save her father's life. With her powers from the Glare-Glare Fruit she can see into anyone's mind."},
{"name": "Cavendish", "summary": "Cavendish is the captain of the Beautiful Pirates. He hates the Straw Hat Pirates and anyone to attracts more fame than himself."},
{"name": "Elizabello II", "summary": "Elizabello II is the king of Prodence."},
{"name": "Hajrudin", "summary": "Hajrudin is a giant warrior who competed at Corrida Colosseum."},
{"name": "Conis", "summary": "Conis is a gentle and kindhearted citizen of the Sky Island, Skypiea. She is the first person to greet Luffy and his crew."},
{"name": "Dalton", "summary": "Dalton is the former captain of the guard of Drum Island and the Sakura Kingdom. Now the elected leader of Drum Island."},
{"name": "Doctor Kureha", "summary": "Doctor Kureha is the lady witch-doctor of Drum Island. The one who properly trained Chopper on his dream to becomes a great doctor."},
{"name": "Gan Fall", "summary": "Gan Fall is the noble former God, ruler, of Skypiea. He was overthrown by Eneru and turned to a mercenary knight of the White Sea."},
{"name": "Gedatsu", "summary": "Gedatsu is one of Eneru's priests and he oversees the Ordeal of Swamp. He is a complete idiot that will often forget to open his mouth to talk."},
{"name": "Kashii", "summary": "Kashii Is one of the giants that was tricked into guarding the gates at Enies Lobby with Oimo. He is part of the crew of Dorry and Broggy."},
{"name": "Koala", "summary": "Koala was once a slave of the Celestial Dragons as a young girl but freed and returned home by Fisher Tiger. Now, she is a high ranking officer of the Revolutionary Army, and a Fish-Man Karate assistant instructor."},
{"name": "Kohza", "summary": "Kohza is the childhood friend of Princess Vivi. He led the rebel forces in the civil war of during the uprising in Alabasta."},
{"name": "Momonga", "summary": "Vice-Admiral Momonga is a member of the Marine Forces based in Marineford."},
{"name": "Oimo", "summary": "Oimo Is one of the giants that was tricked into guarding the gates at Enies Lobby with Kashii. He is par of the crew of Dorry and Broggy."},
{"name": "Perona", "summary": "Perona was the Ghost Princess of Thriller Bark. She ate the Hollow-Hollow Fruit. She can create ghosts that can explode to wipe away all positive feelings. She was sent to Kuraigana Island by Bartholomew Kuma and stayed there during the timeskip with Roronoa Zoro."},
{"name": "Pierre", "summary": "Pierre is the large pink bird that ate the Devil Fruit, Horse-Horse Fruit."},
{"name": "Wyper", "summary": "Wyper is the leader of the Shandian warriors in Skypiea and decedent of Calgara."},
{"name": "Leo", "summary": "Leo is a warrior of the Tontattas People on Greenbit with the powers of the Sew-Sew Devil Fruit"},
{"name": "Wicka", "summary": "Wicka is a member of the Tontatta Reconnaissance Team that spies on the Don Quixote Family."},
{"name": "Arlong", "summary": "Arlong is a sawshark fish-man. He was captain of the all fish-man crew, the Arlong Pirates, and a former member of the Sun Pirates. One of his enemies, Nami, was tricked into serving Arlong as a navigator to make maps of the entire planet so Arlong could conquer all of it. He is the primary antagonist of the Arlong Park Arc."},
{"name": "Mr. 4", "summary": "Member of baroque works. His partner is miss merry christmas."},
{"name": "Monkey D. Dragon", "summary": "Monkey D. Dragon is the father of Luffy and the son of Monkey D. Garp. He is the infamous Revolutionary Leader and has been causing trouble for the World Government for many years."},
{"name": "X. Drake", "summary": "X. Drake is a former rear-admiral of the Navy. He left the military to become the captain of the Drake Pirates. After the timeskip, he joins Kaidou's Crew. He ate an ancient zoan type devil fruit, the Dragon-Dragon Fruit, Allosaurus Model. (Ryu Ryu no Mi, model: Allosaurus). His bounty is 222 Million Belly."},
{"name": "Van Auger", "summary": "Van Auger is the sniper of the Blackbeard Pirates. Like the rest of his crew, he is a strong believer in fate."},
{"name": "Lafitte", "summary": "Lafitte is the navigator of the Blackbeard Pirates. A slender man who was once a police officer who was known for cruelty."},
{"name": "Jewelry Bonney", "summary": "Jewelry Bonney, also known as the \"Big Eater\", is a pirate and captain of the Bonney Pirates. She is one of twelve pirates refereed to as the \"Worst Generation\". She and her crew hailed from the South Blue. Her current bounty is 140,000,000 beli."},
{"name": "Silvers Rayleigh", "summary": "He is the former first mate of the Roger Pirates led by the late Gol D. Roger. After his captain's execution, he retired from piracy and became a coating mechanic in the Sabaody Archipelago. He trained Luffy over the timeskip, particularly how to use the three forms of Haki."},
{"name": "Big Mom", "summary": "Big Mom is the captain of the Big Mom Pirates and is one of the Four Yonko, and the only female member. Her real name is Charlotte Linlin. She was the final Yonko to be mentioned and seen. She resides on a island in the New World called Whole Cake Island. She has a love and craving for anything sweet."},
{"name": "Lao G.", "summary": "Lao G. is a member of the Don Quixote Pirates."},
{"name": "Broggy", "summary": "Broggy is a giant who wields a massive axe and shield in his ongoing feud with his friend Dorry on the island of Little Garden."},
{"name": "Sai", "summary": "Sai is a member of the Kano Kingdom Gang."},
{"name": "Orlumbus", "summary": "Orlumbus is a large man known as the Adventurer of Lies."},
{"name": "Fujitora", "summary": "Fujitora is the blind Admiral of the Navy. He possesses a gravity based Devil Fruit and he represents blind justice. His real name is Issho."},
{"name": "Bartolomeo", "summary": "Bartolomeo is the leader of the Barto Club Pirates and the commander of the 2nd division of the Straw Hat Grand Fleet with a bounty of 200,000,000 berries. He ate the Barrier-Barrier Fruit. He's also a passionate fan of Monkey D. Luffy of the Straw Hat Pirates."},
{"name": "Ideo", "summary": "Ideo is a Triple-X level boxer known as the Cannon of Destruction. His punches have an explosive impact."},
{"name": "Crocus", "summary": "Crocus was once the doctor of the Roger Pirates and now he watches Laboon at the Reverse Mountain lighthouse."},
{"name": "Dorry", "summary": "Dorry, the Blue Ogre, is a giant that wields a massive sword in his ongoing feud with his friend Broggy on Little Garden."},
{"name": "Laboon", "summary": "Laboon is an island whale from the West Blue who followed the Rumbar Pirates and still waits for them at Reverse Mountain."},
{"name": "Pagaya", "summary": "Pagaya is a Dial Ship Engineer and father of Conis. He is a citizen of Skypiea."},
{"name": "South Bird", "summary": "South Bird is a unique and ill-tempered bird from Jaya that always faces South."},
{"name": "Toh-Toh", "summary": "Toh-Toh is the leader of the city of Yuba and father of Kohza."},
{"name": "Kanjuro", "summary": "Kanjuro is a samurai form the Land of Wano and an ally of Kin'emon."},
{"name": "Flapper", "summary": "Flapper is a warrior of the Tontattas People on Greenbit."},
{"name": "Mancherie", "summary": "Mansherry is the princess of the Tontattas People of Greenbit."},
{"name": "Sugar", "summary": "Sugar is a special officer in the Trebol Army branch of the Don Quixote Family. With the powers of the Hobby-Hobby Fruit, she can turn anyone she touches into a toy."},
{"name": "Kumadori", "summary": "Kumadori is a kabuki-fashioned fighter in the Cipher Pol No. 9."},
{"name": "Magellan", "summary": "The chief warden of Impel Down. He can generate poisons to which he alone is immune."},
{"name": "Killer", "summary": "Killer is the masked first-mate of the Kidd Pirates. He is nicknamed the \"massacre soldier\" and is one of the eleven supernovas from the worst generation."},
{"name": "Buffalo", "summary": "Buffalo is a member of Don Quixote Family who ate the Spin-Spin Fruit."},
{"name": "Señor Pink", "summary": "Señor Pink is a member of the Don Quixote Pirates."},
{"name": "Aisa", "summary": "Aisa is a small Shandian tom-boy of a girl. She was born with the ability of Mantra."},
{"name": "Don Chin Jao", "summary": "Don Chin Jao is a member of the Kano Kingdom Gang, and a retired 12th Division Chief of the Happosui Army. He holds a deep resentment toward Monkey D. Garp."},
{"name": "Tank Lepanto", "summary": "Tank Lepanto is a military commander of the Dressrosa Self-Defense Force who competed at Corrida Colosseum."},
{"name": "Nojiko", "summary": "Nojiko is the tattooed bad-girl of Cocoyashi, and older sister to Nami. Both are the adopted daughters of Belle-mère."},
{"name": "Shirahoshi", "summary": "Shirahoshi is a giant smelt-whiting mermaid. She's the princess of the Ryugu Kingdom with the power of the ancient weapon Poseidon."},
{"name": "Duval", "summary": "Duval is the leader of the Rosy Life Riders, and suffered becasue his original face looked similar to Sanji's wanted poster."},
{"name": "Genzo", "summary": "Genzo is the officer and mayor of Cocoyashi in the East Blue. He is like a father to both Nami and Nojiko."},
{"name": "Grandma Nyon", "summary": "Grandma Nyon is a former ruler of Amazon Lily. Now advisory to Boa Hancock. She brought the Boa sisters back to Amazon Lily. Her real name is Gloriosa. She, like the the boa sisters, are acquanted with Silvers Rayleigh."},
{"name": "Jean Bart", "summary": "Jean Bart is a member of the Heart Pirates, who was a pirate captain freed from slavery by Trafalgar Law."},
{"name": "Johnny", "summary": "Johnny is a bounty hunter with his friend and partner Yosaku. Both were partners for a time with Zoro during his bounty hunting days."},
{"name": "Kaya", "summary": "Kaya is a sickly girl who was always entertained by Usopp by his silly stories."},
{"name": "Makino", "summary": "Makino is the bar owner in Windmill Village on Dawn Island, and a friend of Monkey D. Luffy."},
{"name": "Carrot", "summary": "Carrot is a child of Syrup Village and one of Usopp's pirate crew. His head is shaped like a carrot."},
{"name": "Nola", "summary": "Nola is the King of the Sky in the forest of Skypiea."},
{"name": "Patty", "summary": "Chef Patty is the loud mouth chef and rival to fellow chef Sanji at the famous Baratie Restaurant."},
{"name": "Pepper", "summary": "Pepper is a child of Syrup Village and a member of Usopp's pirate crew."},
{"name": "Salome", "summary": "Salome is the personal serpent of Amazon Lily's empress, Boa Hancock."},
{"name": "Sentomaru", "summary": "Sentomaru is a member of the Navy Forces and assistant to Dr. Vegapunk."},
{"name": "Onion", "summary": "Onion is a child of Syrup Village and a member of Usopp's pirate crew."},
{"name": "Woop Slap", "summary": "Woop Slap is the Mayor of Windmill Village."},
{"name": "Yasopp", "summary": "Yasopp is the sniper of the Red-Hair Shanks Pirates and father to Usopp of the Straw Hat Pirates."},
{"name": "Yosaku", "summary": "Yosaku is a bounty hunter with his friend and partner Johnny. Both were partners for a time with Zoro during his bounty hunting days."},
{"name": "Trebol", "summary": "Trebol is an officer of the Don Quixote Family that holds the Clubs Seat."},
{"name": "Giolla", "summary": "Giolla is a member of the Trebol Army branch of the Dox Quixote Family."},
{"name": "Pica", "summary": "Pica is an officer of the Don Quixote Family that holds the Spades Seat."},
{"name": "Rampo", "summary": "Rampo is a warrior of the Tontattas People on Greenbit."},
{"name": "Lucky Roux", "summary": "He is a member of Shank's pirate crew."},
{"name": "Shiryuu", "summary": "Shiryu the Rain is the former warden of Impel Down. Imprisoned in his own jail for slaughtering prisoners for sport. He became a member of the Blackbeard Pirates."},
{"name": "Brownbeard", "summary": "Brownbeard is a pirate who tried to take over Whitebeard territories, but lost his crew and legs t Basil Hawkins."},
{"name": "Urouge", "summary": "Urouge is a pirate captain and one of the Eleven Supernovas. His origins are from the Sky Islands."},
{"name": "Monet", "summary": "Monet is a winged-harpy who is a spy for Don Quixote Doflamingo on Caesar Clown's plans. She also has the power of the Snow-Snow Fruit. She was defeated by Roronoa Zoro and was indirectly killed by Caesar Clown for stabbing her heart believing it was Smoker's instead."},
{"name": "Baby 5", "summary": "Baby 5 is a member of Don Quixote Family who ate the Arms-Arms Fruit."},
{"name": "Kaido", "summary": "Kaido of the Beasts is the Governor-General of the Beasts Pirates, and one of the Yonko ruling over the New World. He is also known as the \"Strongest Creature in the World\". He has a mythical zoan type devil fruit and currently lives in the Country of Wano. He was a former member of the Rocks Pirates, alongside Whitebeard and Big Mom."},
{"name": "Dellinger", "summary": "Dellinger is a member of the Donquixote Pirates."},
{"name": "Boa Marigold", "summary": "Boa Marigold is the sister of Boa Hancock and member of the Kuja Pirates. She ate the Snake-Snake Fruit: Model King Cobra."},
{"name": "Boa Sandersonia", "summary": "Boa Sandersonia is the sister of Boa Hancock and member of the Kuja Pirates. She ate the Snake-Snake Fruit: Model Anaconda."},
{"name": "Bogart", "summary": "Bogart is the direct subordinate of Monkey D. Garp."},
{"name": "Braham", "summary": "Braham is a proud SHandian warrior and ally to Wiper. He uses duel light-guns in combat to blind his enemies."},
{"name": "Suleiman", "summary": "Suleiman is a Class-A war criminal from the Dias Navel Battle."},
{"name": "King Neptune", "summary": "King Neptune is a coelacanth merman, and the king of the Ryugu Kingdom."},
{"name": "Captain Morgan", "summary": "Captain \"Axe-Hand\" Morgan is the former Navy Commander who was stationed on the Island of Shell Town."},
{"name": "Curly Dadan", "summary": "Curly Dadan is a mountain bandit that Garp trusted to watch over and raise Ace and Luffy."},
{"name": "Fukaboshi", "summary": "Fukaboshi is a shark merman and the eldest of the three sons of the royal Neptune family on Fishman Island."},
{"name": "Genbo", "summary": "Genbo is one of the Shandian warriors and ally of the warrior Wyper. He is a rotund, strong fighter."},
{"name": "Gomorrah", "summary": "Gomorrah is a giant King Bull that was saved and adopted by the Franky Family. Gomorrah is normally with his partner Sodom."},
{"name": "Inazuma", "summary": "Inazuma is a member in the Revolutionary Army under Emporio Ivankov. He ate the Snip-Snip Fruit that allows him to cut nearly any surface as easy as cloth."},
{"name": "Kamakiri", "summary": "Kamakiri is a proud Shandian warrior and ally of the great warrior Wyper."},
{"name": "Koshiro", "summary": "Koshiro is the father of Kuina and sensei to Zoro Roronoa. He believed that girls couldn't become strong sword fighters."},
{"name": "Laki", "summary": "Laki is the lone female Shandian warrior and guardian of Aisa."},
{"name": "Mamboshi", "summary": "Mamboshi is an opah merman and the last of the three sons of the royal Neptune family on Fish-Man Island."},
{"name": "Minister of the Left", "summary": "Minister of the Left is a catfish merman in service of King Neptune as a Minister of Ryugu Kingdom."},
{"name": "Minister of the Right", "summary": "Minister of the Right is a seahorse merman in service of King Neptune as a Minister of Ryugu Kingdom."},
{"name": "Montblanc Cricket", "summary": "Montblanc Cricket is the descendant of Montblanc Noland. When he landed on Jaya, he was determined to find the city of cold Norland spoke about."},
{"name": "Carne", "summary": "Carne is one of the chefs of the Baratie Restaurant."},
{"name": "Pekoms", "summary": "Pekoms is a lion member of the Big Mom Pirates."},
{"name": "PX Series", "summary": "The PX Series are humanoid weapons of the Pacifista Army. Created by Dr. Vegapunk and modeled as copies of Bartholomew Kuma."},
{"name": "Ryuboshi", "summary": "Ryuboshi is an oarfish merman and the middle of the three sons of the royal Neptune family on Fishman Island."},
{"name": "Shakuyaku", "summary": "Shakuyaku \"Shakky\" is a former pirate and now proprietor of Shakky's Rip-Off Bar in Sabaody Archipelago."},
{"name": "Shandian Chief", "summary": "Shandian Chief is the village elder to his Shandian people. He is a kind and noble man who has trouble keeping Wiper's temper from ruling him."},
{"name": "Sodom", "summary": "Sodom is a giant King Bull that was saved and adopted by the Franky Family. Sodom is normally with his partner Gomorrah."},
{"name": "Stronger", "summary": "Stronger is Doc Q's horse who carries him around but he is just as sick as his owner."},
{"name": "Gyats", "summary": "Gyats is the announcer at the Corrida Colosseum tournaments in Dressrosa."},
{"name": "Cub", "summary": "Cub is a warrior of the Tontattas People on Greenbit. He ate the Bug-Bug Fruit: Model Rhinoceros Beetle."},
{"name": "Bomba", "summary": ""},
{"name": "Ben Beckman", "summary": "Benn Beckman is the first-mate of the Red-Haired Pirates."},
{"name": "Kuroobi", "summary": "Kuroobi is a ray fish-man martial artist and officer of the Arlong's Pirates."},
{"name": "Vergo", "summary": "Vergo is a Vice-Admiral of the Marines who infiltrated their ranks on the orders of his pirate captain, Don Quixote Doflamingo. He was the first Corazon executive of the Donquixote Family before he infiltrated the marines."},
{"name": "Mocha", "summary": "Mocha is a child who was kidnapped to Punk Hazard and fed a drug to cause her to grow."},
{"name": "Belle-mère", "summary": "Belle-mère is the former Navy officer, who adopted Nami and Nojiko as war orphans. Her greatest joy in life was being their mother."},
{"name": "Uzu", "summary": "Uzu is a young girl who was kept captive on Punk Hazard Island."},
{"name": "Konbu", "summary": "Konbu is a young boy who was kept captive on Punk Hazard Island."},
{"name": "Sind", "summary": "Sind is a young boy who was kept captive on Punk Hazard Island."},
{"name": "Absalom", "summary": "Absalom is a commander of the General Zombies on Thriller Bark. He ate the Clear-Clear Fruit that makes him an invisible man."},
{"name": "Baron Tamago", "summary": "Baron Tamago is a long-legged member of the Big Mam Pirates."},
{"name": "Dagama", "summary": "Dagama is the military tactician of the nation of Prodence."},
{"name": "Blue Gilly", "summary": "Blue Gilly is a longlegged tribe member who's a Jiaokungdo Martial Artist who competed at Corrida Colosseum."},
{"name": "Hody Jones", "summary": "Hody Jones is a great white shark fish-man, and the leader of the New Fishman Pirates, who inherited the will of Arlong. He is the main antagonist of the Fishman Island arc."},
{"name": "Daruma", "summary": "Daruma cookie-cutter shark fishman and an officer of the New Fish-Man Pirates."},
{"name": "Dosun", "summary": "Dosun is a hammerhead shark fish-man and an officers of the New Fish-Man Pirates."},
{"name": "Gaimon", "summary": "Gaimon is a pirated who was stranded on the Island of Rare Animals and stuck into an empty treasure chest."},
{"name": "Gyaro", "summary": "Gyaro is a pop eyed goldfish fish-man member of Macro Pirates. He was once a member of the Sun Pirates under Fisher Tiger."},
{"name": "Hannyabal", "summary": "Hannyabal is the Vice-Warden of the Impel Down prison. His greatest aspiration is to be chief warden and is a bit too open about that."},
{"name": "Heracles", "summary": "Heracles is a hero of Bowin Islands. He trained Usopp in surviving the Bowin Islands."},
{"name": "Hoe", "summary": "Hoe is the large pet whale of King Neptune of Fish-Man Island."},
{"name": "Hyouzou", "summary": "Hyouzou is a poisonous blue-ringed octopus-fishman, who's a mercenary and hired by the New Fish-Man Pirates."},
{"name": "Ikaros Much", "summary": "Ikaros Much is a giant squid fish-man and an officer of the New Fish-Man Pirates,"},
{"name": "Macro", "summary": "Macro is a macropharynx fishman and captain of the Macro Pirates."},
{"name": "McKinley", "summary": "McKinley is the leader of the White Berets, the local authorities to Skypiea."},
{"name": "Merry", "summary": "Merry is the loyal and gentle servant of Kaya in Syrup Village and the designer of the Going Merry."},
{"name": "Miss Friday", "summary": "Miss Friday is a vulture and a member of Baroque Works as the enforcers, The Unluckies."},
{"name": "Mr. 13", "summary": "Mr. 13 is an otter and a member of Baroque Works as the enforcers, The Unluckies."},
{"name": "Ohm", "summary": "Ohm is one of Eneru's Four Priests. He oversees the Ordeal of Iron with his trained dog, Holy."},
{"name": "Shelly", "summary": "Shelly is the looong horse of Tonjit."},
{"name": "Shura", "summary": "Shura is one of Eneru's Four Priests and he oversees the Ordeal of String. He flies on his fire-breathing bird Fuza."},
{"name": "Tansui", "summary": "Tansui arowana fish-man member of Macro Pirates. He was once a member of the Sun Pirates under Fisher Tiger."},
{"name": "Tonjit", "summary": "Tonjit is an elderly resident of Longring Longland. Separated from his fellow nomads for ten LONG years."},
{"name": "Vander Decken IX", "summary": "Vander Decken IX is a Japanese bullhead shark fishman and current captain of the Flying Pirates. He has the powers of the Target-Target Fruit."},
{"name": "Strawberry", "summary": "Vice-Admiral Strawberry is a soldier in the Navy Forces out of Marineford. In Jinbei's flashback with the Sun Pirates, Strawberry was a Rear-Admiral working under Vice-Admiral Borsalino. He first appears as one of the vice-admirals that responded to the buster call on Enies Lobby."},
{"name": "Wadatsumi", "summary": "Wadatsumi is a giant tiger blowfish fishman and a member of the Flying Pirate that is mistaken as a Sea Bonze."},
{"name": "Zeo", "summary": "Zeo is a Japanese wobbegong fishman and an officer of the New Fishman Pirates."},
{"name": "John Giant", "summary": "Vice-Admiral John Giant in a giant solider in the Marine Forces out of Marineford."},
{"name": "Bastille", "summary": "Vice-Admiral Bastille is a commander of the Naval Grand Line Forces stationed at Marineford. He's a large man who wears a horned-iron mask and known as the Shark-Slicer."},
{"name": "Bian", "summary": "Bian is a warrior of the Tontattas People on Greenbit. He ate the Bug-Bug Fruit: Model Hornet."},
{"name": "Gladius", "summary": "Gladius is a member of the Pica Army branch of the Dox Quixote Family."},
{"name": "Chao", "summary": ""},
{"name": "Carrot", "summary": "Carrot is a Rabbit Mink, she is part of the Battlebeast Tribe."},
{"name": "Don-Krieg", "summary": "Don Krieg is the meanest and biggest show-off in all of the show and manga that is One Piece."},
{"name": "Victoria Cindry", "summary": "Victoria Cindry was an actress of great fame who passed away. Her body was reanimated by the powers of Gecko Moria using the shadow of another woman, who hates plates."},
{"name": "Madam Sharley", "summary": "Madam Sharley is a shortfin mako shark mermaid. She's the owner of the Mermaid Cafe in Fish-Man island and a renowned fortune-teller."},
{"name": "Doran", "summary": "Dolan is a young boy who was kept captive on Punk Hazard Island."},
{"name": "Ally", "summary": "Ally is a young girl who was kept captive on Punk Hazard Island."},
{"name": "Surume", "summary": "Surume is a giant Kraken that was blackmailed into serving Hody Jones when he threatened his bothers, but befriended by Luffy."},
{"name": "Aphelandra", "summary": "Aphelandra is an extremely tall Amazon from Amazon Lily and a member of the Defense Warriors."},
{"name": "Atmos", "summary": "Atmos is a member of the Whitebeard Pirates and serves as the Thirteenth Division Commander."},
{"name": "Boo", "summary": "Boo is a member of the Kano Kingdom Gang."},
{"name": "Abdullah", "summary": "Abdullah is a former bounty hunter with his partner Jeet and wanted for bombing government buildings."},
{"name": "Jeet", "summary": "Jeet is a former bounty hunter with his partner Abdullah and wanted for bombing government buildings."},
{"name": "Maynard", "summary": "Maynard is a Vice-Admiral of the Navy that was working undercover as Capman, a gladiator of Corrida Colosseum in Dressroda."},
{"name": "Damask", "summary": "Damask is a arsonist in the Grand Line who competed at Corrida Colosseum."},
{"name": "Hack", "summary": "Hack is a fish-man martial arts master of Fish-Man Jiu-Jitsu who competed at Corrida Colosseum."},
{"name": "Rolling Logan", "summary": "Rolling Logan is a military captain in the Grand Line who competed at Corrida Colosseum."},
{"name": "Queen Otohime", "summary": "Queen Otohime is a goldfish mermaid, queen of the Ryugu Kingdom, wife of King Neptune, and mother of Shirahoshi, Fukaboshi, Ryuboshi, and Mamboshi."},
{"name": "Choo", "summary": "Choo is a smelt-whiting fishman and officer of the Arlong Pirates."},
{"name": "Coribou", "summary": "Coribou is a member of the Caribou Pirates and the younger brother of \"Wet-Hair\" Caribo."},
{"name": "Daisy", "summary": "Daisy is one of the Amazon's of Amazon Lily, and a member of the Kuja Pirates."},
{"name": "Decalvan Brothers", "summary": "Decalvan Brothers are allies of the Whitebeard Pirates. They joined in the battle at Marineford to save Ace"},
{"name": "Den", "summary": "Den is a bering wolffish merman from Fish-Man Island and the younger brother of Tom the Builder. He's a shipwright and a Sea Forest researcher."},
{"name": "Doctor Hiriluk", "summary": "Doctor Hiriluk was one of the last few rogue doctors during Wapol's reign on Drum Island. The man who started Chopper on his dream of being a doctor."},
{"name": "Doctor Nako", "summary": "Doctor Nako is the resident doctor and tattoo artist of Cocoyashi Vlilage. He did both Nami and Nojiko's tattoos."},
{"name": "Dogra", "summary": "Dogra is a member of the Dadan Gang at Mt. Corvo on Dawn Island. He helped to raise Luffy and Ace."},
{"name": "Domino", "summary": "Domino is a lovely but domineering guard of the great prison Impel Down. After the timeskip, she becomes the prison's head jailer after Shiryuu leaves Impel Down with the Blackbeard Pirates."},
{"name": "Hogback", "summary": "Dr. Hogback was once a famous surgeon, but now he's a member of Gecko Morias crew to help him make his zombie army."},
{"name": "Gin", "summary": "Gin is the club-wielding loyalist of the pirate Don Krieg."},
{"name": "Hammond", "summary": "Hammond is a daggertooth pike conger fishman and ammeber of the New Fish-Man Pirates."},
{"name": "Haredas", "summary": "Haredas is a weather scientist from Weatheria. He taught Nami some of his weather science."},
{"name": "Heat", "summary": "Heat is a member of the Kid Pirates."},
{"name": "Hildon", "summary": "Hildon is a zombie created by Dr. Hogback and animated with shadows from Gecko Moria."},
{"name": "Holy", "summary": "Holy is the dog partner to his master Ohm in his Ordeal of Iron. He's a well trained animal who obeys commands."},
{"name": "Jaguar D. Saul", "summary": "Jaguar D. Saul is the former Marine Vice-Admiral. A giant with his own unique laugh. He risked his life to warn Ohara."},
{"name": "Kitton", "summary": "Kitton is a young boy of Mechanical Island that found Franky and tried to save him from becoming boring."},
{"name": "Kuina", "summary": "Kuina is Zoro's childhood friend and number one rival. They both promised to be the greatest sword fighters in the world, but tragically she died at a young age."},
{"name": "Magra", "summary": "Magra is a member of the Dadan Gang at Mt. Corvo on Dawn Island. He helped to raise Luffy and Ace."},
{"name": "Marguerite", "summary": "Marguerite is one of the Kuja Amazons of Amazon Lily, and a member of the Amazon Lily Defense Warriors."},
{"name": "Masira", "summary": "Masira is the captain of the salvage ship Victory Hunter and member of the Saruyama Alliance."},
{"name": "Megalo", "summary": "Megalo is a giant megalodon shark and the beloved pet of Princess Shirahoshi."},
{"name": "Chabo", "summary": "Chabo is a young boy from Gosa Village."},
{"name": "Ran", "summary": "Ran is a member of the Kuja Pirates out of Amazon Lily."},
{"name": "Rindo", "summary": "Rindo is of the the Kuja Pirates based out of Amazon Lily."},
{"name": "Ripper", "summary": "Ripper is a Marine stationed at Shell Town. He is the one who accepted Coby into the Marines."},
{"name": "Sadi-chan", "summary": "Sadi-chan is one of the Chief Guards in Impel Down. Commander of the Four Demon Guards."},
{"name": "Satori", "summary": "Satori is one of Enel's God Enforcers. In Skypiea he is responsible for the area known as the Ordeal of Balls."},
{"name": "Shoujou", "summary": "Shoujou is the captain of the sonar detection vessel Utan Sonar. He is a member of the Saruyama Alliance."},
{"name": "Chouchou", "summary": "Chouchou is a dog from Orange Town that lost his owner. He protects the pet shop that he lived in."},
{"name": "Squard", "summary": "Squard is an ally of the Whitebeard Pirates. He joined in the battle at Marineford. Fooled by Akainu into believing that Whitebeard had betrayed them."},
{"name": "Su", "summary": "Su is a cloud fox found on Skypiea. She is a pet of Conis."},
{"name": "Sweetpea", "summary": "Sweatpea is one of the Amazons from Amazon Lily and a member of the Amazon Lily Defense Warriors."},
{"name": "Taroimo", "summary": "Taroimo is the cybernetic dog of Kitton on Mechanical Island."},
{"name": "Terracotta", "summary": "Terracotta is the wife of Igaram, of the Alabasta Court, as a skilled chef. Her resemblance to her husband is unnerving."},
{"name": "Tom", "summary": "Tom was a fishman shipwright who lived in Water Seven. He built the pirate ship of Gold Roger, and taught Franky and Iceburg to build."},
{"name": "Doberman", "summary": "Vice-Admiral Doberman is a soldier in the Navy out of Marineford. He was one of the Vice-Admirals that responded to the Buster Call on Enies Lobby. He follows the code of Absolute Justice."},
{"name": "Onigumo", "summary": "Vice-Admiral Onigumo is a soldier in the Navy Forces out of Marineford."},
{"name": "Yamakaji", "summary": "Vice-Admiral Yamakaji in a soldier in the Navy Forces out of Marineford."},
{"name": "Vista", "summary": "Vista the \"Floral blade\" is a member of the Whitebeard Pirates and serves as the Fifth Division Commander."},
{"name": "Wire", "summary": "Wire is a member of the Kid Pirates."},
{"name": "Baxcon", "summary": ""},
{"name": "Maujii", "summary": ""},
{"name": "Inhel", "summary": ""},
{"name": "Cotton", "summary": ""},
{"name": "Pedro", "summary": "Pedro is a Jaguar Mink, he is the Leader of the Whale Forest Guardians."},
{"name": "Charlotte Chiffon", "summary": "Big Mom's daughter and Capone Bege's wife, she bears a striking resemblance to Lola."},
{"name": "Napoleon The Bicorn Hat", "summary": "Napoleon is a Homie with a piece of Big Mom's Soul."},
{"name": "Kawamatsu", "summary": ""},
{"name": "Captain Kuro", "summary": "Kuro is a former Captain of Black Cat pirate crew. He is now a butler for Kaya. Kuro has the power to move at super speeds."},
{"name": "Ryuuma", "summary": "Ryuma was legendary samurai from the Wano Country was turned into a Zombie General by Dr. Hogback hundreds of years after his death. In life, he dreamed of fighting the greatest swordsman in the world, the mysterious \"King\", not knowing this was a moniker others gave him."},
{"name": "San Juan Wolf", "summary": "One of the level 6 prisoners who joined the blackbeard crew"},
{"name": "Vasco Shot", "summary": "Vasco Shot is a member of the Blackbeard Pirates recruited as an escapee of Impel Down."},
{"name": "Catarina Devon", "summary": "The crescent moon hunter is the most dangerous female pirate to be placed in impel down"},
{"name": "Cerberus", "summary": "Cerberus is the three-headed dog who guards the entrance to Thriller Bark, and created by Dr. Hogback. It's sensitive about being part fox."},
{"name": "Spartan", "summary": "Spartan is a large, angry warrior who tried competing at Corrida Colosseum for the Flame-Flame Fruit."},
{"name": "Amazon", "summary": "Amazon is the old gate-keeper and informer at the entrance to Skypiea known as Heaven's Gate."},
{"name": "Avalo Pizarro", "summary": "Avalo Pizarro is a member of the Blackbeard Pirates recruited as an escapee of Impel Down."},
{"name": "Blamenco", "summary": "Blamenco is a member of the Whitebeard Pirates and serves as the Sixth Division Commander."},
{"name": "Boodle", "summary": "Boodle is the mayor of Orange Town and was the only person to remain when Buggy invaded."},
{"name": "Kelly Funk", "summary": "Kelly Funk is the older brother of the assassin team The Funk Brothers. He's a Jacket Man who has the powers of the Jacket-Jacket Devil Fruit."},
{"name": "Fighting Bull", "summary": "Fighting Bull is a fighter in the Grand Line who competed at Corrida Colosseum known as The Brutal Bull. Luffy later tamed him and named him Moocy."},
{"name": "Acilia", "summary": "Acilia is a gladiator in the Grand Line who competed at Corrida Colosseum."},
{"name": "Meadows", "summary": "Meadows is a gladiator in the Grand Line who competed at Corrida Colosseum."},
{"name": "Mummy", "summary": "Mummy is a sorcerer in the Grand Line who competed at Corrida Colosseum."},
{"name": "T-Bone", "summary": "Captain T-Bone is the freighting and powerful Captain in the Navy forces. He is an honor bound commander to his devoted men."},
{"name": "Very-Good", "summary": "Captain Very-Good is a Marine soldier. He ate the Beri-Beri Fruit. This makes his body immune to blunt forces."},
{"name": "Corgi", "summary": "Corgi is a worker in the World Government that constantly tried to get Iceburg to hand over the blueprints for Pluton."},
{"name": "Cosmos", "summary": "Cosmos is an Amazon from Amazon Lily, and a member of the Kuja Pirates."},
{"name": "Curiel", "summary": "Curiel is a member of the Whitebeard Pirates and serves as the Tenth Division Commander."},
{"name": "Doma", "summary": "Doma is an ally of the Whitebeard Pirates. He joined in the battle at Marineford to save Ace."},
{"name": "Fossa", "summary": "Fossa is a member of the Whitebeard Pirates and serves as the Fifteenth Division Commander."},
{"name": "Foxy", "summary": "Foxy the Silver Fox is the captain of the Foxy Pirates, who ate the Slow-Slow Devil Fruit."},
{"name": "Fuza", "summary": "Fuza is the bird ridden by Shura in the Ordeal of String. He doesn't naturally breath fire, but uses a Flame Dial to give the illusion."},
{"name": "Hamburg", "summary": "Hamburg is a member of the Foxy Pirate crew and sidekick to the captain, Foxy."},
{"name": "Haruta", "summary": "Haruta is a member of the Whitebeard Pirates and serves as the Twelfth Division Commander."},
{"name": "Hiramera", "summary": "Hiramera is a olive flounder mermaid from Mermaid Cove in Fish-Man Island."},
{"name": "Ishilly", "summary": "Ishilly is a mermaid from Mermaid Cove in Fish-Man Island."},
{"name": "Izo", "summary": "Izo is a member of the Whitebeard Pirates and serves as the Sixteenth Division Commander. He dresses in Kabuki style."},
{"name": "Kingdew", "summary": "Kingdew is a member of the Whitebeard Pirates and serves as the Eleventh Division Commander."},
{"name": "Lily", "summary": "Lily is a member of the Bellamy Pirates."},
{"name": "Lola", "summary": "Lola is the captain of the Rolling Pirates. Desperate to marry, she asks every man she meets for marriage."},
{"name": "Zombie Lola", "summary": "Zombie Lola is the zombie form of Lola, and she's desperately in love with Absalom."},
{"name": "McGuy", "summary": "McGuy is an ally if the Whitebeard Pirates. He joined in the battle at Marinesford to save Ace."},
{"name": "Mero", "summary": "Mero is a smelt-whiting mermaid from Mermaid Cove in Fish-Man Island."},
{"name": "Minokoala", "summary": "Minokoala is one of the Four Demon Guards under the command of Sadi-chan. He's a Devil Fruit user who became like a koala."},
{"name": "Miss Monday", "summary": "Miss Monday is an agent of Baroque Works. she's a massive and strong woman."},
{"name": "Momoo", "summary": "Momoo is a giant sea cow who was once apart of Arlong's crew."},
{"name": "Montblanc Noland", "summary": "Montblanc Noland is the man who discovered the City of Gold, Shandoria, but was disgraced in history, as Noland the Lair, when it couldn't be found again."},
{"name": "Mr. 9", "summary": "Mr. 9 was the male partner to Miss. Wednesday, Princess Vivi, as a member of Crocodile's Baroque Works organization."},
{"name": "Myure", "summary": "Myure is the doctor of the Bellamy Pirates."},
{"name": "Namule", "summary": "Namule is a Fish-man member of the Whitebeard Pirates and serves as the Eighth Division Commander."},
{"name": "Nerine", "summary": "Nerine is an Amazon of Amazon Lily. She is a curious person who loves to learn. She's always taking notes."},
{"name": "Oars", "summary": "Oars is a supreme giant-zombie. He was repaired and animated by the powers of Gecko Moria with the shadow of Monkey D. Luffy."},
{"name": "Little Oars Jr.", "summary": "Little Oars Jr. is a decedent of the supreme-giant Oars. He is one of the allies of the Whitebeard Pirates."},
{"name": "Octopako", "summary": "Octopako is a octopus-fishwoman who Hatchan was trying to court."},
{"name": "Mashikaku", "summary": "Mashikaku is an officer in the Navy at Loguetown under Smoker and Tashigi."},
{"name": "Porche", "summary": "Porche is a loyal member and number one idol of Foxy's Foxy Pirates crew."},
{"name": "Portgas D. Rouge", "summary": "Portgas D. Rouge was the mother of Protgas D. Ace. She risked her life to save her unborn son, but died shortly after giving birth."},
{"name": "Rakuyo", "summary": "Rakuyo is a member of the Whitebeard Pirates and serves as the Seventh Division Commander."},
{"name": "Rika", "summary": "Rika is the daughter of the local tavern owner in Shell Town. She's helped Zoro, and she's friends with Coby and Helmeppo."},
{"name": "Risky Brothers", "summary": "The Risky Brothers are two pirate members of Lola's Rolling Pirates. They keep track of Lola's mounting rejection tally."},
{"name": "Saint Charloss", "summary": "Saint Charloss is one of the Celestial Dragon. He is a dim and careless individual who's personality is more akin to a bratty, spoiled child."},
{"name": "Saint Roswald", "summary": "Saint Roswald is one of the Celestial Dragons. An arrogant, cruel, and headstrong man. Father of Charloss and Shalria."},
{"name": "Saint Shalria", "summary": "Saint Shalria is one of the Celestial Dragons. She is just as wicked and heartless as her father, Saint Roswald."},
{"name": "Sarquiss", "summary": "Sarquiss is the right hand of Bellamy of the Bellamy Pirates."},
{"name": "Seira", "summary": "Seira is a bluestriped angelfish mermaid from Mermaid Cove in Fish-Man Island."},
{"name": "Bunchi", "summary": "Bunchi is the giant turtle used for transportation by Miss All Sunday, Nico Robin."},
{"name": "Spandine", "summary": "Spandine at one time was the leader of the Cipher Pol 9. He is the father of the current leader Spandam."},
{"name": "Speed Jill", "summary": "Speed Jill is a member of the Whitebeard Pirates and serves as the Fourteenth Division Commander."},
{"name": "Dr. Vegapunk", "summary": "Dr. Vegapunk is the world's genius. He's made many great advances in the study of Devil Fruits and technology."},
{"name": "Lacroix", "summary": "Vice-Admiral Lacroix Is a member of the Navy's Giant Squad."},
{"name": "Chess", "summary": "Chess is the former Head of Staff of King Wapol's Drum Kingdom."},
{"name": "Kuromarimo", "summary": "Kuromarimo is the former commander in Wapol's Drum Kingdom."},
{"name": "Yama", "summary": "Yama is one of the God's Warriors under Eneru's command. A giant of a man who is one of Eneru's true loyalists"},
{"name": "Nezumi", "summary": "Captain Nezumi is a Navy Officer of the 16th Branch in the East Blue."},
{"name": "Shachi", "summary": "Shachi is a member of the Heart Pirates."},
{"name": "Penguin", "summary": "Penguin is a member of the Heart Pirates."},
{"name": "Pincers", "summary": "Pincers is a giant desert crab of Alabasta."},
{"name": "Gancho", "summary": "Gancho is the Chief Tonta leader of the Kingdom of Tontta on Greenbit."},
{"name": "Scarlet", "summary": "Scarlet is a former member of the Riku Royal Family and the mother of Rebecca."},
{"name": "Farul", "summary": "Farul is the white horse of Cavendish, captain of the Beautiful Pirates."},
{"name": "Pellini", "summary": ""},
{"name": "Bobomba", "summary": ""},
{"name": "Sheepshead", "summary": "Sheepshead is a mysterious pirate who attack Sanji's group on an island."},
{"name": "BB", "summary": "BB (BlackBack) is a Gorilla Mink, he part of the Whale Forest Guardian."},
{"name": "Roddy", "summary": "Roddy is a Bull Mink, he part of the Whale Forest Guardian."},
{"name": "Duke Dogstorm", "summary": "Dogupine is the King of Mokomo Dukedom."},
{"name": "Cat Viper", "summary": "Cat Viper is the king of the night, on Zou."},
{"name": "Vito The Phantom Gun", "summary": "Vito is the advisor for the Firetank Pirates."},
{"name": "Jack the Drought", "summary": "Jack the Drought is a Fish-man and one of Kaido's three All-star, He is the captain of the Mammoth's crew and ruler of the region Kuri in Wano."},
{"name": "Charlotte Pudding", "summary": "Pudding is the 35th daughter of Charlotte Linlin and the fiancee of Sanji. She possesses a third eye and has a sinister nature."},
{"name": "Vinsmoke Reiju", "summary": "Vinsmoke Reiju is eldest child and only daughter of Vinsmoke Judge, and the older sister of Sanji, Ichiji, Niji, and Yonji. She is a princess of the Germa Kingdom, and is one of the commanders of Germa 66, under the epithet of Poison Pink."},
{"name": "Zeus The Stormcloud", "summary": "Zeus is a Homie with a piece of Big Mom's Soul."},
{"name": "Prometheus The Sun", "summary": "Prometheus is a Homie with a piece of Big Mom's Soul."},
{"name": "Kikunojo", "summary": "Kikunojo of the lingering snow is one of the nine red scabbards."},
{"name": "Yarisugi", "summary": "Commodore Yarisugi is an officer in the Marine's G-5 Unit under Vice-Admiral Smoker and Vice-Admiral Vergo."},
{"name": "Adele", "summary": "Adele is a mermaid from Mermaid Cove in Fish-Man Island."},
{"name": "Aladdin", "summary": "Aladdin is a brotula merman who is the doctor of the Sun Pirates."},
{"name": "Baskerville", "summary": "Three-Headed Baskerville is the Chief-Justice of the Enies Lobby Courts. Though he apears as a three-headed man. He is in fact just three good friends."},
{"name": "Big Pan", "summary": "Big Pan is a half-fish-man/giant member of the Foxy Pirates, and a member of the Groggy Monsters for the Davy Back Fight games."},
{"name": "Biyo", "summary": "Biyo is a young boy who was kept captive on Punk Hazard Island."},
{"name": "Blenheim", "summary": "Blenheim is a member of the Whitebeard Pirates and serves as the Ninth Division Commander."},
{"name": "Blue Fan", "summary": "Blue Fan is an Amazon from Amazon Lily, and the most diminutive members of the Kuja Pirates."},
{"name": "Blue Gorillas", "summary": "Blue Gorillas are the guard enforcers of Impel Down. Mostly in charge of patrolling Level 1."},
{"name": "Bluejam", "summary": "Bluejam is the ruthless captain of the Bluejam Pirates."},
{"name": "Bobby Funk", "summary": "Bobby Funk is the younger brother of the assassin team The Funk Brothers."},
{"name": "Gambia", "summary": "Gambia is the chief of staff on the Bartolomeo Pirates."},
{"name": "Agyo", "summary": "Agyo is the fighting lion in the Grand Line who competed at Corrida Colosseum."},
{"name": "Butchie", "summary": "Butchie is a member of Captain Kuro's Black Cat Pirates; along with his brother, Siam. A cowardly person who was enhanced through the Jango's hypnotism."},
{"name": "Calgara", "summary": "Calgara is the great champion of the Shandian Kingdom and friend to Montblanc Norland. His descendant is the warrior Wiper."},
{"name": "Chuchun", "summary": "Chuchun is the giant Sparrow that Itomimizu rides while he announces for the Davy Back Fights."},
{"name": "Disco", "summary": "Disco was the main auctioneer and operator of the Human Auctioning House in Sabaody Archipelago."},
{"name": "Elizabeth", "summary": "Elizabeth is a citizen of Peachy Island of the Kamabakka Kingdom."},
{"name": "Enishida", "summary": "Enishida is an Amazon of Amazon Lily. She is the attendant to the castle of Boa Hancock."},
{"name": "Fisher Tiger", "summary": "Fisher Tiger was a sea bream Fish-Man and the founder and original captain of the Sun Pirates, who were notorious for freeing the slaves from Marie Jois. He is considered a hero of Fish-Man Island."},
{"name": "Higuma", "summary": "Higuma is the leader of the mountain bandits that bullied the people of Windmill Village."},
{"name": "Inuppe", "summary": "Inuppe is a zombie created by Dr. Hogback as part of Perona's zombie guard. He was animated with the shadow of Sanji from the Straw Hat Pirates."},
{"name": "Itomimizu", "summary": "Itomimizu is a member of the Foxy Pirates crew. He works as the announcer for all their Davy Back Fight competitions, normally aboard his bird ChuChun."},
{"name": "Jigoro", "summary": "Jigoro is a zombie of a swordsman who died, and he was reanimated with the shadow of Roronoa Zoro as part o Gecko Moria's zombie army."},
{"name": "Capote", "summary": "Capote is a fish-man member of the Foxy Pirates, who competes in the Davy Back Fight game of Donut Race."},
{"name": "Kikyo", "summary": "Kikyo is one of the Amazons of Amazon Lily. She is a strict and strong fighter from the Amazon Lily Defense Warriors."},
{"name": "Kong", "summary": "Fleet-Admiral Kong was the Commander-in-Chief of the Navy for the World Government."},
{"name": "Kumacy", "summary": "Kumacy is a bear zombie of Thriller Bark. Animated by Dr. Hogback and Gecko Moria. He is the faithful servant of Perona, but she doesn't allow him to speak."},
{"name": "Ichika", "summary": "Ichika is one of the Guppy Mermaid Quintuplets."},
{"name": "Nika", "summary": "Nika is one of the Guppy Mermaid Quintuplets."},
{"name": "Sanka", "summary": "Sanka is one of the Guppy Mermaid Quintuplets."},
{"name": "Yonka", "summary": "Yonka is one of the Guppy Mermaid Quintuplets."},
{"name": "Yonka 2", "summary": "Yonka 2 is one of the Guppy Mermaid Quintuplets."},
{"name": "Minorhinoceros", "summary": "Minorhinoceros in one of the Four Demon Guards of Impel Down under Sadi-chan. He is a Devil Fruit user who became like a rhino."},
{"name": "Minotaurus", "summary": "Minotaurus is one of the four Demon Guard of Impel Down. He is a Devil Fruit user of incredible strength and speed."},
{"name": "Minozebra", "summary": "Minozebra is one of the Demon Guards of of Impel Down under the command of Sadi-chan. He is a Devil Fruit user who became like a zebra."},
{"name": "Miss Father's Day", "summary": "Miss Father's Day is a member of the Baroque Works sniper team. Along with her partner, Mr. 7. Dresses in frog decor."},
{"name": "Monda", "summary": "Monda is a member of the Foxy Pirates and provided the main engine for the Cutie Wagon in the Davy Back Fights."},
{"name": "Motobaro", "summary": "Motobaro is the large cow that Duval owns and rides on whenever he goes out."},
{"name": "Mr. 7", "summary": "Mr. 7 a member of the Baroque Works sniper pair. Along side Miss Father's Day."},
{"name": "Nero", "summary": "Nero the Weasel is the latest addition to the ranks of the Cipher Pol No. 9."},
{"name": "Oinkchuck", "summary": "Oinkchuck is one of the Surprise Zombies in the castle of Thriller Bark."},
{"name": "Brannew", "summary": "Brannew is a commodore of the Navy, stationed at Marineford"},
{"name": "Cancer", "summary": "Vice-Admiral Cancer is a solider of the Navy."},
{"name": "Stainless", "summary": "Vice-Admiral Stainless is a commanding officer of the Navy."},
{"name": "Pickles", "summary": "Pickles is a member of the Foxy Pirates and a member of the special Groggy Monsters for the Davy Back Fights."},
{"name": "Professor Clover", "summary": "Professor Clover the lead scholar of Ohara at the Tree of Knowledge. A friend of Olivia Nico, he was one of Robin's few friends as a child."},
{"name": "Zombie Risky Brothers", "summary": "Zombie Risky Brothers are the zombie animals created by Dr. Hogback as part of Perona's zombie servants. They are animated by the shadows of the Risky Brothers from the Rolling Pirates."},
{"name": "Saldeath", "summary": "Saldeath is a diminutive Chief Guard of Impel Down and in charge of the Blue Gorillas."},
{"name": "Stelly", "summary": "Stelly is an arrogant noble-child who was adopted by the Sabo's parents after their real son ran away."},
{"name": "Thatch", "summary": "Thatch was the commander of the Fourth Division of the Whitebeard Pirates before he was murdered for the Devil Fruit he had found."},
{"name": "Dalmatian", "summary": "Vice-Admiral Dalmatian is a member of the Navy out of Marineford. He had the Dog-Dog Fruit Model: Dalmatian."},
{"name": "Lonz", "summary": "Vice-Admiral Lonz is a member of the Navy's Giant Squad."},
{"name": "Wanze", "summary": "Wanze is the eccentric member of of the Cipher Pol No. 7 squad of the World Government. He produces ramen noodles through his nose."},
{"name": "Rock", "summary": "Rock is one of the Yeti Cool Brothers assassins."},
{"name": "Scotch", "summary": "Scotch is one of the Yeti Cool Brothers assassins."},
{"name": "Yorki", "summary": "Yorki was the captain of the Rumbar Pirates."},
{"name": "Lassoo", "summary": "Lassoo is a gun that somehow ate the Devil Fruit the Dog-Dog Fruit Model Dachshund, making it a living breathing dog-gun that fires explosives from it's mouth."},
{"name": "Scotch", "summary": "Scotch is an ally of Kaido of the Four Emeperors that guards one of Kaido's islands."},
{"name": "Milo", "summary": "Milo is a human man of Dressrosa who has changed into a toy dog called Onepoko."},
{"name": "Donquixote Rocinante", "summary": "Don Quixote Rocinante is the second Corazon officer of the Don Quixote Family, and the younger brother of Don Quixote Doflamingo. He's a Silent-Man with the power of the Calm-Calm Fruit."},
{"name": "Saint Don Quixote Homing", "summary": "Saint Don Quixote Homing is the father of Doflamingo and Rocinante. He was once a Celestial Dragon who left the world nobles to live among the common people."},
{"name": "Kyuin", "summary": ""},
{"name": "Wanda", "summary": "Wanda is a Dog Mink, she is part of the Battlebeast Tribe."},
{"name": "Gotti", "summary": "Gotti is a pirate hit man, he is part of the Firetank Pirates."},
{"name": "Vinsmoke Yonji", "summary": "Yonji is the Winch Green of Germa 66, He is Sanji's younger brother."},
{"name": "Charlotte Brûlée", "summary": "Charlotte Linlin's 8th daughter."},
{"name": "Charlotte Perospero", "summary": "Big Mom's oldest son, has the powers of the Pero Pero no Mi."},
{"name": "Charlotte Mont-d'Or", "summary": "One of Big Mom's children."},
{"name": "Charlotte Katakuri", "summary": "Katakuri is the second son of the Charlotte Family, and one of the Three Sweet Commanders of the Big Mom Pirates. He has a bounty of 1,057,000,000 beri. He is the secondary antagonist of the Whole Cake Island Arc."},
{"name": "Gerd", "summary": "Gerd a giant who lived on Elbaph."},
{"name": "Streusen", "summary": "Co-founder of the Big Mom Pirates."},
{"name": "Otama", "summary": "Otama is a straw hats weaver from Wano"},
{"name": "Ashura Doji", "summary": "Ashura Douji is one of the Nine Red Scabbards. He also goes by the name of Shutenmaru."},
{"name": "Queen", "summary": "Queen is is an All-Star of the Beasts Pirates. He possesses the ancient zoan type devil fruit, Ryu Ryu no Mi, model: Brachiosaurus. (Dragon Dragon Fruit, Brachiosaurus model)."},
{"name": "Page One", "summary": "Page One is a Headliner and member of the Flying Six of the Beasts Pirates."},
{"name": "Stansen", "summary": "Stansen is a giant from Elbaf and a member of the New Giant Warrior Pirates."},
{"name": "Kozuki Oden", "summary": "Kozuki Oden was the daimyo of Kuri in Wano Country, and the father of Momonosuke and Hiyori. He was also a former member of the Whitebeard Pirates, and later, the Roger Pirates."},
{"name": "Hyogoro", "summary": ""},
{"name": "Rockstar", "summary": "The newest member of the Red Hair Pirates."},
{"name": "Kaneshiro", "summary": "Kaneshiro is a member of the Arlong Pirates"},
{"name": "Shiki", "summary": "Shiki is the captain of the Flying Pirates, the first known prisoner to ever escape Impel Down, and a former member of the Rocks Pirates. He ate the Float-Float Fruit that lets him make any object fly."},
{"name": "Kankichi Ryotsu", "summary": "A laid back Katsushika policeman."},
{"name": "Smiley", "summary": "Smiley is the explosive-slime monster created by Ceasar Clown on Punk Hazard Island."},
{"name": "Nico Olivia", "summary": "Nico Olivia is an archeologist, and the mother of Robin Nico. With the others of Ohara, she sought to uncover the mystery of the missing century."},
{"name": "Pandaman", "summary": "Pandaman is a character Eiichiro Oda has hidden in many scenes of One Piece, in the anime, manga, and movies."},
{"name": "Albion", "summary": "Albion is a rookie-pirate that was about to join the Impostor Straw Hat Pirates."},
{"name": "Bacura", "summary": "Bacura is a large black panther from Amazon Lily, and a pet of the Kuja Pirates."},
{"name": "Banchina", "summary": "Banchina is the wife of Yasopp of the Red-Haired Pirates and mother to Ussopp of the Straw Hat Pirates."},
{"name": "Belladonna", "summary": "Belladonna is the doctor on the island of Amazon Lily, and she is one of the Kuja Amazons."},
{"name": "Bobbin", "summary": "Bobbin is a member of the Big Mom Pirates."},
{"name": "Jean Ango", "summary": "Jean Ango is a bounty hunter that uses swords and other arms as his weapons to throw."},
{"name": "Captain John", "summary": "Captain John is a famous pirate who was known for having hidden a great treasure. His body was reanimated as a zombie by Dr. Hogback."},
{"name": "Shu", "summary": "Captain Shu is a Navy soldier. He at the Rust-Rust Fruit. No blade can cut him without turning to rust."},
{"name": "Chocolate", "summary": "Chocolate is a member of the Impostor Straw Hat Pirates. She tried to impersonate Nami."},
{"name": "Cocoa", "summary": "Cocoa is a member of the Imposter Straw Hat Pirates. She tried to impersonate Nico Robin."},
{"name": "Demalo Black", "summary": "Demalo Black is a pirate who formed a fake versions of the Straw Hat Pirates to try and benefit from their reputation."},
{"name": "Drip", "summary": "Drip is a member of the Impostor Straw Hat Pirates. He tried to impersonate Sanji."},
{"name": "Fillonce", "summary": "Fillonce is a mermaid from Mermaid Cove in Fish-Man Island and dancer of the Mermaid Cafe."},
{"name": "Gyro", "summary": "Gyro is a pirate captain from the South Blue who was traveling to the New World."},
{"name": "Harisenbon", "summary": "Harisenbon a member of the New Fish-Man Pirates and commander of the Sea Urchin-Armor Spine Squad."},
{"name": "Hocker", "summary": "Hocker is the owner of the local pet shop in Orange Town. He passed away due to an illness and left the shop to his beloved dog, Shu-Shu."},
{"name": "Hotori and Kotori", "summary": "Hotori and Kotori are twin brothers and lieutenants of the Enforcers."},
{"name": "Indigo", "summary": "Dr. Indigo is the scientific genius who created the creatures for Shiki."},
{"name": "Jerry", "summary": "Jerry is a World Government agent and member of the Cipher Pol No. 6."},
{"name": "Kadar", "summary": "Rear Admiral Kadar is a soldier from the G-2 Marine base that attacked the Sun Pirates."},
{"name": "Kairen", "summary": "Kairen is a righteye flounder mermaid from Mermaid Cove in Fish-Man Island."},
{"name": "Kasagoba", "summary": "Kasagoba is a marbled rockfish fishman member of the New Fish-Man Pirates."},
{"name": "Kibagaeru", "summary": "Kibagaeru was once the captain of the Fanged Toad Pirates, but joined the Foxy Pirates after losing in the Davy Back Fight."},
{"name": "Koala's Mom", "summary": "Koala's Mom is the mother of Koala on Foolshout Island."},
{"name": "Lip Doughty", "summary": "Lip \"Service\" Doughty is a rookie pirate that looked to join the Impostor Straw Hat Pirates."},
{"name": "Lulis", "summary": "Lulis is a mermaid from Mermaid Cove in Fish-Man Island."},
{"name": "Maidy", "summary": "Maidy is a maid in the royal court of the family of Alabasta."},
{"name": "Manjaro", "summary": "Manjaro is a member of the Impostor Straw Hat Pirates. He tried to impersonate Roronoa Zoro."},
{"name": "Maria Napole", "summary": "Maria Napole is a famous mermaid singer on Fish-Man Island."},
{"name": "Maunburuten", "summary": "Maunburuten is a member of the Impostor Straw Hat Pirates. He tried to impersonate Sogeking."},
{"name": "Mikazuki", "summary": "Mikazuki is a pirate captain that has a bounty of 36.000.000 Berry."},
{"name": "Musse", "summary": "Musse is the daughter of the great Shandian warrior Clagara. She lived on Jaya 400 years ago when it was still whole."},
{"name": "Ippon-Matsu", "summary": "Ippon-Matsu is the owner of the sword-smith store in Loguetown, where Zoro was given the Sandai Kitetsu and Yubashiri."},
{"name": "Pearl", "summary": "Pearl the Iron Wall is the pirate in the employ of Don Krieg. Wearing iron plates, studded in pearls, forms a nearly unbreakable wall of defense."},
{"name": "Porchemy", "summary": "Porchemy is a member of the Bluejam Pirates."},
{"name": "Ririka", "summary": "Ririka is the mother of Rika, and owner of the Shell Town Bar"},
{"name": "Roshio", "summary": "Roshio was a pirate captain that had a bounty of 42.000.000 Berries."},
{"name": "Sabo's Mother", "summary": "Sabo's Mother is a noble from the Goa Kingdom who wanted her son Sabo to marry a princess to increase the family status and wealth."},
{"name": "Outlook III", "summary": "Outlook III is a noble from the Goa Kingdom who wanted his son Sabo to marry a princess to increase the family status and wealth."},
{"name": "Saint Jalmack", "summary": "Saint Jalmack is a member of the Celestial Dragons who visited Dawn Island."},
{"name": "Saint Myosgard", "summary": "Saint Myosgard is a member of the Celestial Dragons who went to Fish-Man Island."},
{"name": "Siam", "summary": "Siam is a member of Captain Kuro's Black Cat Pirates; along with his brother, Butchie. A cowardly person who was enhanced by Jango's hypnotism."},
{"name": "Sora", "summary": "Sora is a mermaid from Mermaid Cove in Fish-Man Island."},
{"name": "Stray Fox", "summary": "Stray Fox is a fox that was being used by the Impostor Straw Hat Pirates to be their version of Tony-Tony Chopper."},
{"name": "Taralan", "summary": "Taralan is a gigantic spider-monkey zombie that was created by Dr. Hogback and brought to life by Gecko Moria at Thriller Bark."},
{"name": "Turkey", "summary": "Turkey is a member of the Impostor Straw Hat Pirates. He tried to impersonate Franky."},
{"name": "Wapol's Father", "summary": "Wapol's Father was once the kind and fair king of Drum Island before his death."},
{"name": "Whitey Bay", "summary": "Whitey Bay is an ally of the Whitebeard Pirates. She joined in the battle at Marineford to save Ace."},
{"name": "Kuina's Mother", "summary": "Kuina's Mother is the mother of Kuina and wife of Koshiro in Frost Moon Village."},
{"name": "Nefertari Titi", "summary": "Nefertari Titi was once the queen of Alabasta, and she's the mother of Vivi Nefertari"},
{"name": "Esta", "summary": "Esta is a civilian woman of Dressrosa who has forgotten her human lover after he was changed into a toy."},
{"name": "Gramma", "summary": "Gramma is a member of the Tontattas People on Greenbit and Leo's grandmother."},
{"name": "Camel", "summary": "Camel is the giant penguin companion of Kuzan."},
{"name": "Ibusu", "summary": ""},
{"name": "Lami", "summary": ""},
{"name": "Wellington", "summary": ""},
{"name": "Diez Barrels", "summary": "Father of X. Drake"},
{"name": "Gimlet", "summary": ""},
{"name": "Lucianne", "summary": ""},
{"name": "Rivers", "summary": ""},
{"name": "Sarkies", "summary": ""},
{"name": "Scarlett", "summary": "The mother of Rebecca, Older sister of Viola, Wife of Kyros and first-born daughter of King Riku. She was shot and killed by Diamante."},
{"name": "Miss Buckin", "summary": "Miss Buckin is the self-proclaimed lover of Whitebeard and is the Mother of the Edward Weevil."},
{"name": "Edward Weevil", "summary": "Edward is the self-proclaimed son of Whitebeard and is currently part of the Seven Warlords of The Sea."},
{"name": "Raizo Terashima", "summary": "Raizo is the Chief Engineer of Border's R&amp;D."},
{"name": "Ryunosuke", "summary": "Ryunosuke is a drawing of a Dragon, that help the Straw Hats climb to Zou."},
{"name": "Shishilian", "summary": "Shishilian is a Lion Mink and one of the three Dogupine Musketeers, he is known as Captain of the storm."},
{"name": "Purin Purin", "summary": "Commodore of the 77th branch of the Marines."},
{"name": "Miss Universe", "summary": "Wapol's wife after he became successful."},
{"name": "Raizo of the Mist", "summary": "Raizo is a ninja from the Wano, he part of the Kozuki Clan."},
{"name": "Charlotte Praline", "summary": "Praline is the 29th Daughter of Big Mom, She is the wife of Aladdin, the doctor and first mate of the New Sun Pirates."},
{"name": "Vinsmoke Judge", "summary": "The King of Germa Kingdom and the biological father of Sanji and his four siblings. He is the leader of the Vinsmoke Family."},
{"name": "Randolph", "summary": "Uses the epithet Crane Rider. Member of Big Mom's crew."},
{"name": "Vinsmoke Ichiji", "summary": "One of Sanji's older brothers."},
{"name": "Vinsmoke Niji", "summary": "One of Sanji's older brothers."},
{"name": "Capone Petz", "summary": "Baby son of Capone Bege and Charlotte Chiffon."},
{"name": "Charlotte Cracker", "summary": "Cracker is the tenth son of the Charlotte Family, and one of the Three Sweet Commanders of the Big Mom Pirates. He also serves as Totto Land's Minister of Biscuit. He is a major antagonist in the Whole Cake Island Arc."},
{"name": "Charlotte Galette", "summary": "One of Big Mom's children."},
{"name": "Charlotte Opera", "summary": "One of Big Mom's children."},
{"name": "Amande", "summary": "One of the top enforcers in Big Mom's crew."},
{"name": "Charlotte Smoothie", "summary": "Smoothie is the 14th daughter of the Charlotte Family, and one of the Three Sweet Commanders of the Big Mom Pirates. She also serves as Totto Land's Minister of Juice. She is a supporting antagonist in the Whole Cake Island Arc."},
{"name": "Diesel", "summary": ""},
{"name": "Umit", "summary": "Umit know as Deep-Sea Currents, he is the Shipping King."},
{"name": "Giberson", "summary": "Giberson know as The hider, he is the warehouse kingpin."},
{"name": "Morgans", "summary": "Morgans is the president of the World Economic Journal."},
{"name": "Drug Peclo", "summary": "Peclo is the major undertaker."},
{"name": "Stussy", "summary": "Stussy is the queen of the pleasure district."},
{"name": "Du Feld", "summary": "Du know as God Of Fortune, he is the loan shark king."},
{"name": "Charlotte Daifuku", "summary": "Big Mom's third son."},
{"name": "Charlotte Oven", "summary": "Big Mom's fourth son."},
{"name": "Charlotte Compote", "summary": "Oldest daughter of the Charlotte family."},
{"name": "Morley", "summary": ""},
{"name": "Belo Berry", "summary": ""},
{"name": "Lindbergh", "summary": ""},
{"name": "Karasu", "summary": ""},
{"name": "Charlotte Snack", "summary": ""},
{"name": "Comil", "summary": ""},
{"name": "Sharinguru", "summary": ""},
{"name": "Gion", "summary": ""},
{"name": "Tokikake", "summary": ""},
{"name": "King", "summary": "King The Conflagration is an All-Star of the Beasts Pirates, One of Kaido's three closest Confidants. He is part of an extinct race that as yet to be identify and possesses an ancient zoan type devil fruit: Ryu Ryu no Mi, model: Pteranodon. (Dragon Dragon Fruit, Pteranodon model)."},
{"name": "Faust", "summary": "Faust is a cat mink and a member of the Hawkins Pirates."},
{"name": "Goldberg", "summary": "Goldberg is a giant from Elbaf and a member of the New Giant Warrior Pirates."},
{"name": "Road", "summary": "Road is a giant from Elbaf and a member of the New Giant Warrior Pirates."},
{"name": "Ginrummy", "summary": ""},
{"name": "Pinkbeard", "summary": ""},
{"name": "Urashima", "summary": ""},
{"name": "Gazelleman", "summary": ""},
{"name": "Batman", "summary": ""},
{"name": "Mouseman", "summary": ""},
{"name": "Holdem", "summary": ""},
{"name": "Speed", "summary": ""},
{"name": "Uni", "summary": "Uni is a member of the Heart Pirates"},
{"name": "Ikkaku", "summary": "Ikkaku is the only female member of the Heart Pirates."},
{"name": "Clione", "summary": "Clione is a member of the Heart Pirates"},
{"name": "Islewan", "summary": "Islewan is an ally of the Whitebeard Pirates. He joined in the battle at Marineford to save Ace."},
{"name": "Karma", "summary": "Karma is an ally of the Whitebeard Pirates. He joined in the battle at Marineford to save Ace."},
{"name": "Epoida", "summary": "Epoida is an ally of the Whitebeard Pirates. He joined in the battle at Marineford to save Ace."},
{"name": "Kyoshiro", "summary": "Kyoshiro is a samurai and a yakuza boss in wano country."},
{"name": "Charlotte Yuen", "summary": "Charlotte Yuen is the 64th child of the Charlotte Family."},
{"name": "Charlotte Nougat", "summary": "Charlotte Nougat is the 75th child of the Charlotte Family."},
{"name": "Charlotte Raisin", "summary": "Charlotte Raisin is the 60th child of the Charlotte Family."},
{"name": "Charlotte Joconde", "summary": "Charlotte Joconde is the 59th child of the Charlotte Family."},
{"name": "Charlotte Brownie", "summary": "Charlotte Brownie is the 58th child of the Charlotte Family."},
{"name": "Charlotte Kato", "summary": "Charlotte Kato is the 49th child of the Charlotte Family."},
{"name": "Charlotte Noisette", "summary": "Charlotte Noisette is the 15th son and 24th child of the Charlotte Family."},
{"name": "Charlotte Saint-Marc", "summary": "Charlotte Saint-Marc is the 8th child of the Charlotte Family."},
{"name": "Charlotte Nusstorte", "summary": "Charlotte Nusstorte is the 21st child of the Charlotte Family."},
{"name": "Charlotte Custard", "summary": "Charlotte Custard is the sixth daughter and 16th child of the Charlotte Family."},
{"name": "Charlotte Newshi", "summary": ""},
{"name": "Charlotte Marble", "summary": "Charlotte Marble is the 55th child of the Charlotte Family."},
{"name": "Charlotte Compo", "summary": "Charlotte Compo is the 28th child of the Charlotte Family."},
{"name": "Charlotte Zuccotto", "summary": "Charlotte Zuccotto is the 18th child of the Charlotte Family."},
{"name": "Charlotte Mozart", "summary": "Charlotte Mozart is the 31st child of the Charlotte Family."},
{"name": "Charlotte Broye", "summary": "Charlotte Broye is the 20th child of the Charlotte Family."},
{"name": "Charlotte Dacquoise", "summary": "Charlotte Dacquoise is the 41st child of the Charlotte Family."},
{"name": "Charlotte Basskarte", "summary": "Charlotte Basskarte is the 22nd child of the Charlotte Family."},
{"name": "Charlotte Mondee", "summary": "Charlotte Mondée is the sixth child of the Charlotte Family."},
{"name": "Tsukimi", "summary": ""},
{"name": "Seamars", "summary": "Captain Seamars is the captain of the Space Pirates."},
{"name": "Gina", "summary": ""},
{"name": "Donovan", "summary": "Donovan is one of the fifty mechanics of the Foxy Pirates."},
{"name": "Farafra", "summary": ""},
{"name": "Erik", "summary": ""},
{"name": "Kebi", "summary": ""},
{"name": "Columbus", "summary": "Columbus is a member of the Yonta Maria Grand Fleet."},
{"name": "Charlotte Mobile", "summary": "Charlotte Mobile is the 54th child of the Charlotte Family"},
{"name": "Charlotte Myukuru", "summary": "Charlotte Myukuru is the 56th child of the Charlotte Family."},
{"name": "Kozuki Hiyori", "summary": "Komurasaki is the Daughter of Oden Kozuki, the younger sister of Momonosuke Kozuki and the Granddaughter of Sukiyaki Kozuki. Her real name is Hiyori Kozuki."},
{"name": "Toko", "summary": ""},
{"name": "Andre", "summary": ""},
{"name": "Candre", "summary": ""},
{"name": "Glove", "summary": ""},
{"name": "Makko", "summary": ""},
{"name": "Kibin", "summary": ""},
{"name": "Daifugo", "summary": ""},
{"name": "Madilloman", "summary": ""},
{"name": "Alpacaman", "summary": ""},
{"name": "Solitaire", "summary": ""},
{"name": "Babanuki", "summary": ""},
{"name": "Dobon", "summary": ""},
{"name": "Stalker", "summary": ""},
{"name": "Zotto", "summary": ""},
{"name": "Mozambia", "summary": ""},
{"name": "Sicily", "summary": ""},
{"name": "Catacombo", "summary": ""},
{"name": "Daigin", "summary": ""},
{"name": "Gorilla", "summary": ""},
{"name": "Bakezo", "summary": ""},
{"name": "Pike", "summary": ""},
{"name": "Jero", "summary": ""},
{"name": "Gal", "summary": ""},
{"name": "Bomba", "summary": ""},
{"name": "Ban Dodeshine", "summary": ""},
{"name": "Beer VI", "summary": ""},
{"name": "Ramen", "summary": ""},
{"name": "Tea IV", "summary": ""},
{"name": "Ham Burger", "summary": ""},
{"name": "Tacos", "summary": ""},
{"name": "Mororon", "summary": ""},
{"name": "Fukurokuju", "summary": ""},
{"name": "Daikoku", "summary": ""},
{"name": "Hanzo", "summary": ""},
{"name": "Shimotsuki Yasuie", "summary": ""},
{"name": "Milky", "summary": ""},
{"name": "Koncelot", "summary": ""},
{"name": "Giovanni", "summary": ""},
{"name": "Im", "summary": "Im is an extremely high-ranking individual in the World Government whom even the Five Elders bow down to, and the one who sits on the Empty Throne. However, Im's existence is a secret to the rest of the world."},
{"name": "Ramba", "summary": ""},
{"name": "Shinobu", "summary": "Shinobu is a old female ninja from Wano Country."},
{"name": "Elmy", "summary": ""},
{"name": "Kinderella", "summary": ""},
{"name": "Shimotsuki Ushimaru", "summary": ""},
{"name": "Onimaru", "summary": ""},
{"name": "Kozuki Toki", "summary": ""},
{"name": "Miss Catherina", "summary": "Miss Catherina a member of the Baroque Work."},
{"name": "Sarahebi", "summary": ""},
{"name": "Snakeman", "summary": ""},
{"name": "Rabbitman", "summary": ""},
{"name": "Kinga", "summary": ""},
{"name": "Brew", "summary": ""},
{"name": "Laskey", "summary": ""},
{"name": "Seagull", "summary": ""},
{"name": "Hotei", "summary": ""},
{"name": "Sasaki", "summary": ""},
{"name": "Black Maria", "summary": ""},
{"name": "Who's Who", "summary": ""},
{"name": "Ulti", "summary": ""},
{"name": "Chome", "summary": ""},
{"name": "Jigoku Benten", "summary": ""},
{"name": "Bishamon", "summary": ""},
{"name": "Fujin", "summary": ""},
{"name": "Raijin", "summary": ""}
]
